Request/EB_purchasePartnerProduct_INT.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:pfws="http://pfws.webservices.symantec.com/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
      <pfws:purchasePartnerProduct>
         <purchasePartnerProductRequest>
            <requestVendor>
               <vendorID>10004</vendorID>
                <vendorPW>(k3aD^7^JCM</vendorPW>
               <vendorSiteID>1000389</vendorSiteID>
            </requestVendor>
            <version>201922</version>
            <partnerAccountDetails>
               <partnerId>1015980</partnerId>
               <partnerUserId>EB_UserID_490977</partnerUserId>
            </partnerAccountDetails>
            <partnerUnitCode>BASELINE</partnerUnitCode>
            <userAccountList>
               <userAccount>
                  <userAccountReferenceId>1</userAccountReferenceId>
                  <partnerAccountDetails>
                     <partnerId>1015980</partnerId>
                     <partnerUserId>EB_UserID_490977</partnerUserId>
                  </partnerAccountDetails>
                  <accountProfile>
                     <emailAddressList>
                        <emailAddress>
                           <address>UN_490977@selenium.com</address>
                           <type>PERSONAL</type>
                           <rank>1</rank>
                           <usability>1</usability>
                        </emailAddress>
                     </emailAddressList>
                     <namePrefix>Mr.</namePrefix>
                     <firstName>Primary</firstName>
                     <lastName>John</lastName>
                     <address>
                        <addressLine1>900 Corporate Pointe</addressLine1>
                        <city>Culver City</city>
                        <country>US</country>
                        <postalCode>90230</postalCode>
                        <province>CA</province>
                        <type>HOME</type>
                     </address>
                     <phoneNumberList>
                        <phoneNumber>
                           <number>3107137019</number>
                           <type>H</type>
                           <countryCode>US</countryCode>
                           <rank>1</rank>
                           <usability>1</usability>
                        </phoneNumber>
                     </phoneNumberList>
                  </accountProfile>
                  <additionalInformation>
                     <dateOfBirth>1950-01-01</dateOfBirth>
                     <gender>MALE</gender>
                     <personalIdentificationList>
                        <!--1 or more repetitions:-->
                        <personalIdentification>
                           <value>213144715</value>
                           <type>SSN</type>
                        </personalIdentification>
                        <personalIdentification>
                           <value>99998232</value>
                           <type>DRIVER_LICENSE</type>
                        </personalIdentification>
                     </personalIdentificationList>
                  </additionalInformation>
               </userAccount>
            </userAccountList>
            <requestInfo>
               <requestID>req9954861TEST</requestID>
               <resend>0</resend>
            </requestInfo>
            <partnerOrderDetail>
               <orderID>req4329686TEST</orderID>
            </partnerOrderDetail>
            <orderItemList>
               <orderItem>
                  <baseProductPurchaseOrder>
                     <orderItemNo>1</orderItemNo>
                     <skup>
                        <value>21392140</value>
                     </skup>
                     <quantity>1</quantity>
                     <promoCodeInstanceId>null</promoCodeInstanceId>                     
                     <userPurchaseDetails>
                        <userAccountReferenceId>1</userAccountReferenceId>
                        <consentList>
                           <consent>
                              <documentId>1</documentId>
                              <documentVersion>1</documentVersion>
                              <documentType>FCRA</documentType>
                           </consent>
                           <consent>
                              <documentId>2</documentId>
                              <documentVersion>1</documentVersion>
                              <documentType>T&amp;C</documentType>
                           </consent>
                        </consentList>
                     </userPurchaseDetails>
                  </baseProductPurchaseOrder>
               </orderItem>
            </orderItemList>
         </purchasePartnerProductRequest>
      </pfws:purchasePartnerProduct>
   </soapenv:Body>
</soapenv:Envelope>